tap "buo/cask-upgrade"

brew "mise"
brew "starship"

cask "1password"
cask "arc"
cask "cleanshot"
cask "doubao"
cask "feishu"
cask "fork"
cask "google-chrome"
cask "ogdesign-eagle"
cask "notion"
cask "rapidapi"
cask "raycast"
cask "surge"
cask "thebrowsercompany-dia"
cask "trae"
cask "visual-studio-code"
cask "webstorm"

vscode "aaron-bond.better-comments"
vscode "algorizen.javascript-snippets"
vscode "antfu.file-nesting"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "mikestead.dotenv"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "redhat.vscode-yaml"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "usernamehw.errorlens"
vscode "vira.vsc-vira-theme"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wakatime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
