tap "buo/cask-upgrade"

brew "displayplacer"
brew "mise"
brew "starship"

cask "surge"
cask "1password"

cask "raycast"
cask "chatgpt"
cask "codex"
cask "arc"
cask "notion"
cask "cleanshot"
cask "rapidapi"
cask "fork"
cask "cleanmymac"
cask "sf-symbols"
cask "thebrowsercompany-dia"
cask "visual-studio-code"
cask "webstorm"
cask "android-platform-tools"
cask "feishu"
cask "figma"
cask "google-chrome"
cask "mweb-pro"
cask "ogdesign-eagle"