tap "buo/cask-upgrade"

brew "mise"
brew "starship"

cask "surge"
cask "1password"

cask "ghostty"
cask "claude"
cask "claude-code"
cask "chatgpt"
cask "codex"
cask "codex-app"
cask "notion"
cask "cleanshot"
cask "rapidapi"
cask "fork"
cask "sf-symbols"
cask "thebrowsercompany-dia"
cask "visual-studio-code"
cask "intellij-idea"
cask "android-platform-tools"
cask "feishu"
cask "figma"
cask "google-chrome"
cask "mweb-pro"
cask "ogdesign-eagle"
cask "wechat"